Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML10_DFP/3.3.82/edc/ATSAML10D14A.PIC
    </edc:ConfigFuseSector>
    <edc:UserIDSector atdf:pagesize="0x40" edc:beginaddr="0x804008" edc:endaddr="0x804100" edc:erasepagesize="0x100" edc:regionid="userid"/>
    <edc:ConfigFuseSector atdf:pagesize="0x40" edc:beginaddr="0x80C000" edc:endaddr="0x80C100" edc:erasepagesize="0x100" edc:regionid="BOCOR_FUSES">
      <edc:AdjustPoint edc:_addr="0x80C000" edc:offset="0x4"/>
      <edc:DCRDef edc:_addr="0x80C004" edc:access="------------------------nnnnnnnn" edc:cname="BOCOR_WORD_1" edc:default="0xFFFFFF00" edc:factorydefault="0xFFFFFF00" edc:impl="0xFF" edc:nzwidth="0x20" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" ltx:memberofperipheral="FUSES">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSES">
            <edc:DCRFieldDef edc:cname="IDAU_BOOTPROT" edc:desc="Boot Protection" edc:nzwidth="0x8"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:AdjustPoint edc:_addr="0x80C008" edc:offset="0x38"/>
      <edc:DCRDef edc:_addr="0x80C040" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="BOCOR_WORD_16" edc:default="0xFFFFFFFF" edc:factorydefault="0xFFFFFFFF" edc:impl="0xFFFFFFFF" edc:nzwidth="0x20" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" ltx:memberofperipheral="FUSES">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSES">
            <edc:DCRFieldDef edc:cname="BOOTROM_CRCKEY_0" edc:desc="CRC Key bits 31:0" edc:nzwidth="0x20"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x80C044" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="BOCOR_WORD_17" edc:default="0xFFFFFFFF" edc:factorydefault="0xFFFFFFFF" edc:impl="0xFFFFFFFF" edc:nzwidth="0x20" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" ltx:memberofperipheral="FUSES">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSES">
            <edc:DCRFieldDef edc:cname="BOOTROM_CRCKEY_1" edc:desc="CRC Key bits 63:32" edc:nzwidth="0x20"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x80C048" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="BOCOR_WORD_18" edc:default="0xFFFFFFFF" edc:factorydefault="0xFFFFFFFF" edc:impl="0xFFFFFFFF" edc:nzwidth="0x20" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" ltx:memberofperipheral="FUSES">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSES">
            <edc:DCRFieldDef edc:cname="BOOTROM_CRCKEY_2" edc:desc="CRC Key bits 95:64" edc:nzwidth="0x20"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x80C04C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="BOCOR_WORD_19" edc:default="0xFFFFFFFF" edc:factorydefault="0xFFFFFFFF" edc:impl="0xFFFFFFFF" edc:nzwidth="0x20" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" ltx:memberofperipheral="FUSES">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSES">
            <edc:DCRFieldDef edc:cname="BOOTROM_CRCKEY_3" edc:desc="CRC Key bits 127:96" edc:nzwidth="0x20"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:ConfigFuseSector>
    <edc:GPRDataSector edc:beginaddr="0x20000000" edc:endaddr="0x20001000" edc:isexecutable="true" edc:regionid="HSRAM" edc:rw="rw"/>
    <edc:SFRDataSector edc:beginaddr="0x40000000" edc:endaddr="0x40008000" edc:regionid="APBA" edc:rw="rw"/>
    <edc:SFRDataSector edc:beginaddr="0x41000000" edc:endaddr="0x41010000" edc:regionid="APBB" edc:rw="rw"/>
    <edc:SFRDataSector edc:beginaddr="0x42000000" edc:endaddr="0x42004000" edc:regionid="APBC" edc:rw="rw"/>
    <edc:SFRDataSector edc:beginaddr="0xE0000000" edc:endaddr="0xE000F000" edc:regionid="PPB" edc:rw="rw">
      <edc:AdjustPoint edc:_addr="0xE0000000" edc:offset="0x1000"/>
      <edc:SFRDef edc:_addr="0xE0001000" edc:access="nnnnnnnnnnnnnnnn---nnnnnnnnnnnnn" edc:cname="DWT_CTRL" edc:impl="0xFFFF1FFF" edc:mclr="00001011000000000000000000000000" edc:nzwidth="0x20" edc:por="00001011000000000000000000000000" ltx:memberofperipheral="DWT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="CYCCNTENA" edc:desc="CYCCNT enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="POSTPRESET" edc:desc="POSTCNT preset" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="POSTINIT" edc:desc="POSTCNT initial" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="CYCTAP" edc:desc="Cycle count tap" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SYNCTAP" edc:desc="Synchronization tap" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="PCSAMPLENA" edc:desc="PC sample enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="EXCTRCENA" edc:desc="Exception trace enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CPIEVTENA" edc:desc="CPI event enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXCEVTENA" edc:desc="Exception event enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SLEEPEVTENA" edc:desc="Sleep event enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LSUEVTENA" edc:desc="LSU event enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FOLDEVTENA" edc:desc="Fold event enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CYCEVTENA" edc:desc="Cycle event enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CYCDISS" edc:desc="Cycle counter disabled secure" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NOPRFCNT" edc:desc="No profile counters" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NOCYCCNT" edc:desc="No cycle count" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NOEXTTRIG" edc:desc="No external triggers" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NOTRCPKT" edc:desc="No trace packets" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NUMCOMP" edc:desc="Number of comparators" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
